In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [75]:
df = pd.read_excel('Raigad.xlsx','1988-97')
df.head()

,INDEX,YEAR,MONTH,DATE,MAXIMUM TEMP.,MINIMUM TEMP.,AVARAGE WIND SPEED,RANFALL
0,43058,1988,1,1,31.9,18.0,7.0,0.0
1,43058,1988,1,2,30.6,18.1,7.0,0.0
2,43058,1988,1,3,32.0,18.8,7.0,0.0
3,43058,1988,1,4,32.0,19.4,8.0,0.0
4,43058,1988,1,5,32.5,18.9,9.0,0.0

In [90]:
df.mean()# Average Data of 1988-97
df.T

,INDEX,YEAR,MONTH,DATE,MAXIMUM TEMP.,MINIMUM TEMP.,AVARAGE WIND SPEED,RANFALL
0,43058.0,2002.768087,6.514054,15.724424,31.308305,22.837032,12.833261,6.025234

In [91]:
df2 = pd.read_excel('Raigad.xlsx','98-08')
df2.head()

,INDEX,YEAR,MONTH,DATE,MAXIMUM TEMP.,MINIMUM TEMP.,AVARAGE WIND SPEED,RANFALL
0,43058,1998,1,1,27.9,20.4,7.0,0.0
1,43058,1998,1,2,32.1,20.7,5.0,0.0
2,43058,1998,1,3,29.1,20.5,0.0,0.0
3,43058,1998,1,4,30.3,21.4,5.0,0.0
4,43058,1998,1,5,34.7,21.4,0.0,0.0

In [92]:
df2.mean()# Average Data of 1998-08

INDEX                 43058.000000
YEAR                   2002.476217
MONTH                     6.499723
DATE                     15.720409
MAXIMUM TEMP.            31.527268
MINIMUM TEMP.            22.971409
AVARAGE WIND SPEED       12.574260
RANFALL                   6.308229
dtype: float64

In [93]:
df1 = pd.read_excel('Raigad.xlsx','08-18')
df1.head()

,INDEX,YEAR,MONTH,DATE,MAXIMUM TEMP.,MINIMUM TEMP.,AVARAGE WIND SPEED,RANFALL
0,43058,2008,1,1,28.1,17.4,7.0,0.0
1,43058,2008,1,2,28.1,15.8,8.0,0.0
2,43058,2008,1,3,28.1,16.4,8.0,0.0
3,43058,2008,1,4,27.3,16.3,7.0,0.0
4,43058,2008,1,5,27.8,16.5,6.0,0.0

In [94]:
df1.mean()# Average Data of 1908-18

INDEX                 43058.000000
YEAR                   2013.328454
MONTH                     6.520128
DATE                     15.721409
MAXIMUM TEMP.            31.319629
MINIMUM TEMP.            22.968167
AVARAGE WIND SPEED       12.677950
RANFALL                   5.587981
dtype: float64

In [95]:
a = df.mean()+df2.mean()+df1.mean()   # Addition of 3 Decades
a.T

0                    NaN
AVARAGE WIND SPEED   NaN
DATE                 NaN
INDEX                NaN
MAXIMUM TEMP.        NaN
MINIMUM TEMP.        NaN
MONTH                NaN
RANFALL              NaN
YEAR                 NaN
dtype: float64

In [96]:
ab = a/3  # Average of 3 years data
ab

0                    NaN
AVARAGE WIND SPEED   NaN
DATE                 NaN
INDEX                NaN
MAXIMUM TEMP.        NaN
MINIMUM TEMP.        NaN
MONTH                NaN
RANFALL              NaN
YEAR                 NaN
dtype: float64

In [97]:
df = pd.DataFrame(ab)
a = df.T
a

,0,AVARAGE WIND SPEED,DATE,INDEX,MAXIMUM TEMP.,MINIMUM TEMP.,MONTH,RANFALL,YEAR
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN